//
//  Localizable.strings
//  Nextcloud
//
//  Copyright © 2017 Marino Faggiana. All rights reserved.
//
//  Author Marino Faggiana <marino.faggiana@nextcloud.com>
//
//  This program is free software: you can redistribute it and/or modify
//  it under the terms of the GNU General Public License as published by
//  the Free Software Foundation, either version 3 of the License, or
//  (at your option) any later version.
//
//  This program is distributed in the hope that it will be useful,
//  but WITHOUT ANY WARRANTY; without even the implied warranty of
//  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
//  GNU General Public License for more details.
//
//  You should have received a copy of the GNU General Public License
//  along with this program.  If not, see <http://www.gnu.org/licenses/>.
//

"_cancel_"                  = "ยกเลิก";
"_edit_"                    = "แก้ไข";
"_tap_to_cancel_"           = "แตะเพื่อยกเลิก";
"_tap_to_min_max_"          = "Tap to minimize / maximize";
"_cancel_request_"          = "คุณต้องการยกเลิกหรือไม่?";
"_upload_file_"             = "อัปโหลดไฟล์";
"_download_file_"           = "ดาวน์โหลดไฟล์";
"_delete_"                  = "ลบ";
"_rename_"                  = "เปลี่ยนชื่อ";
"_rename_file_"             = "เปลี่ยนชื่อไฟล์";
"_rename_folder_"           = "เปลี่ยนชื่อโฟลเดอร์";
"_move_"                    = "ย้าย";
"_add_"                     = "เพิ่ม";
"_save_"                    = "บันทึก";
"_warning_"                 = "คำเตือน";
"_error_"                   = "ข้อผิดพลาด";
"_no_"                      = "ไม่";
"_yes_"                     = "ใช่";
"_select_"                  = "เลือก";
"_select_all_"              = "เลือกทั้งหมด";
"_upload_"                  = "Upload";
"_home_"                    = "ไฟล์";
"_files_"                   = "ไฟล์";
"_ok_"                      = "ตกลง";
"_done_"                    = "เสร็จสิ้น";
"_clear_"                   = "ล้าง";
"_selected_"                = "เลือกแล้ว";
"_no_active_account_"       = "No account found";
"_info_"                    = "ข้อมูล";
"_warning_"                 = "คำเตือน";
"_video_"                   = "วิดีโอ";
"_overwrite_"               = "เขียนทับ";
"_create_"                  = "Create";
"_create_folder_"           = "สร้างโฟลเดอร์";
"_create_folder_e2ee_"      = "สร้างโฟลเดอร์เข้ารหัส";
"_close_"                   = "ปิด";
"_remove_"                  = "ลบออก";
"_file_not_found_"          = "ไม่พบไฟล์";
"_continue_"                = "ดำเนินการต่อ";
"_continue_editing_"        = "แก้ไขต่อ";
"_auto_upload_folder_"      = "อัปโหลดอัตโนมัติ";
"_photo_"                   = "รูปภาพ";
"_audio_"                   = "เสียง";
"_unknown_"                 = "ไม่ทราบ";
"_success_"                 = "สำเร็จ";
"_mode_filename_"           = "โหมดชื่อไฟล์";
"_warning_owncloud_"        = "You are connected to an ownCloud server. This is untested and unsupported, use at your own risk. To upgrade to Nextcloud, see https://nextcloud.com/migration.";
"_warning_unsupported_"     = "You are using an unsupported version of Nextcloud. For the safety of your data we strongly recommend updating to the latest stable Nextcloud.";
"_restore_"                 = "คืนค่า";
"_tap_here_to_change_"      = "แตะที่นี่เพื่อเปลี่ยน";
"_no_albums_"               = "ไม่มีอัลบั้ม";
"_denied_album_"            = "This app does not have access to \"Photos\". You can enable access in Privacy Settings.";
"_denied_camera_"           = "This app does not have access to the \"Camera\". You can enable access in Privacy Settings.";
"_force_start_"             = "บังคับเริ่มต้น";
"_account_not_available_"   = "The account %@ of %@ does not exist, please add it.";
"_the_account_"             = "The account";
"_does_not_exist_"          = "does not exist";
"_sharing_"                 = "การแชร์";
"_details_"                 = "รายละเอียด";
"_no_permission_add_file_"  = "You don't have permission to add files.";
"_no_permission_delete_file_" = "You don't have permission to delete files.";
"_no_permission_modify_file_" = "You don't have permission to modify files.";
"_no_permission_favorite_file_" = "You don't have permission to add the file to your favorites.";
"_add_folder_info_"         = "เพิ่มข้อมูลโฟลเดอร์";
"_back_"                    = "ย้อนกลับ";
"_search_"                  = "ค้นหา";
"_of_"                      = "จาก";
"_livephoto_save_"          = "Save Live Photo to Photo Album";
"_livephoto_save_error_"    = "Error during save of Live Photo.";
"_livephoto_no_"            = "Disable Live Photo";
"_convert_live_photo_"      = "Convert to Live Photo";
"_file_conflict_num_"       = "ไฟล์ที่ขัดแย้ง";
"_file_conflicts_num_"      = "ไฟล์ที่ขัดแย้ง";
"_file_conflict_desc_"      = "คุณต้องการเก็บไฟล์ใดบ้าง?\nถ้าคุณเลือกทั้งสองรุ่น ชื่อของไฟล์ที่ถูกคัดลอกจะมีตัวเลขเพิ่มเข้าไป";
"_file_conflict_new_"       = "ไฟล์ใหม่";
"_file_conflict_exists_"    = "ไฟล์ที่มีอยู่เดิม";
"_file_not_rewite_doc_"     = "It is not possible to overwrite a document but only to create a new one.";
"_move_or_copy_"            = "Move or copy";
"_move_copy_diff_account_"  = "You cannot copy or move files between different accounts.";
"_copy_"                    = "คัดลอก";
"_now_"                     = "ตอนนี้";
"_wait_"                    = "กรุณารอสักครู่ ...";
"_recent_"                  = "ล่าสุด";
"_view_in_folder_"          = "ดูในโฟลเดอร์";
"_leave_share_"             = "ออกจากการแชร์นี้";
"_disabled_"                = "Disabled";
"_compact_"                 = "Compact";
"_normal_"                  = "Normal";
"_verbose_"                 = "Verbose";
"_standard_"                = "Standard";
"_maximum_"                 = "Maximum";
"_error_occurred_"          = "An error occurred, please try again.";
"_retry_"                   = "Retry";
"_images_"                  = "Images";
"_confirm_"                 = "Confirm";
"_confirm_continue_"        = "Confirm by continuing the previous uploading";
"_confirm_resetting_"       = "Confirm ignoring previous uploading";
"_background_location_access_title_"    = "Background Location Access";
"_background_location_access_message_"  = "This app needs background location access to automatically upload files when you move between areas. GPS is not used and your location is never stored.";
"_enable_background_location_title_"    = "Enable Background Location";
"_enable_background_location_message_"  = "To allow automatic file uploads in the background, please enable 'Always' for location access in Settings.";
"_enable_background_location_footer_"   = "To keep your photo library up to date automatically, this app can use background location access.\nThis allows it to detect when you’re in a new area and check for new photos to upload.\nGPS is not used, and your location is never stored or tracked.";

/* MARK: Files lock */

"_lock_"                            = "ล็อก";
"_unlock_"                          = "Unlock";
"_lock_file_"                       = "ล็อกไฟล์";
"_unlock_file_"                     = "ปลดล็อกไฟล์";
"_lock_selected_files_"             = "ล็อกไฟล์";
"_unlock_selected_files_"           = "ปลดล็อกไฟล์";
"_locked_by_"                       = "ถูกล็อกโดย %@";
"_file_locked_no_override_"         = "ไฟล์นี้ถูกล็อก ไม่สามารถแทนที่ได้";
"_lock_no_permissions_selected_"    = "Not allowed for some selected files or folders.";
"_remove_file_"             = "เอาไฟล์ออก";
"_delete_file_"             = "ลบไฟล์";
"_delete_folder_"           = "ลบโฟลเดอร์";
"_size_"                    = "ขนาด";
"_set_user_status_"         = "Online status";
"_set_user_status_message_" = "Status message";
"_open_settings_"           = "เปิดการตั้งค่า";
"_settings_account_request_" = "สอบถามบัญชีตอนเริ่มการทำงาน";
"_alias_"                   = "นามแฝง";
"_alias_placeholder_"       = "Write alias";
"_alias_footer_"            = "Give your accounts a descriptive name such as Home, Office, School…";
"_privacy_legal_"           = "นโยบายความเป็นส่วนตัวและกฎหมาย";
"_source_code_"             = "รับโค้ดต้นฉบับ";
"_account_select_"          = "เลือกบัญชี";
"_account_select_to_add_"   = "เลือกบัญชีที่จะเพิ่ม";
"_remove_local_account_"    = "Remove local account";
"_want_delete_account_"     = "Do you want to remove local account?";
"_prevent_http_redirection_"= "The redirection in HTTP is not permitted.";
"_single_file_conflict_title_" = "ไฟล์ที่ขัดแย้ง";
"_multi_file_conflict_title_" = "%@ ไฟล์มีข้อขัดแย้ง";
"_replace_action_title_" = "แทนที่";
"_keep_both_action_title_" = "เก็บไว้ทั้งสองอย่าง";
"_cancel_keep_existing_action_title_" = "ยกเลิกและเก็บที่มีอยู่";
"_replace_all_action_title_" = "แทนที่ทั้งหมด";
"_keep_both_for_all_action_title_" = "เก็บไว้ทั้งคู่สำหรับทั้งหมด";
"_more_action_title_" = "ข้อมูลเพิ่มเติม";
"_wait_file_preparation_" = "Preparing file upload. Please wait …";
"_keep_active_for_upload_" = "Keep application active until upload is completed …";
"_keep_active_for_transfers_" = "Keep application active until the transfers are completed …";
"_wait_file_encryption_"  = "Please wait, encrypting file…";
"_passcode_counter_fail_" = "Too many failed attempts, please wait before reattempting.";
"_seconds_"               = "seconds";
"_change_lock_passcode_"  = "Change passcode";
"_lock_cannot_disable_mdm_" = "Disabling the passcode lock is not permitted by your configuration profile.";

// MARK: User Status

/* User status */
"_online_"                  = "ออนไลน์";

/* User status */
"_away_"                    = "ไม่อยู่";

/* User status */
"_dnd_"                     = "ห้ามรบกวน";

/* User status */
"_dnd_description_"         = "ปิดการแจ้งเตือนทั้งหมด";

/* User status */
"_invisible_"               = "มองไม่เห็น";

/* User status */
"_invisible_description_"   = "แสดงเป็นออฟไลน์";

/* User status */
"_busy_"                    = "Busy";

/* User status */
"_select_user_status_"      = "Set online status";
"_select_status_message_"      = "Set status message";
"_status_message_"          = "ข้อความสถานะ";
"_status_message_placehorder_"  = "สถานะของคุณคืออะไร";
"_online_status_"           = "สถานะออนไลน์";
"_set_status_message_"      = "กำหนดข้อความสถานะ";
"_clear_status_message_after_"  = "Clear status after";

/* User status */
"_select_option_"           = "เลือกตัวเลือก";
"_dont_clear_"              = "ไม่ต้องล้าง";
"_15_minutes_"              = "15 minutes";
"_30_minutes_"              = "30 นาที";
"_an_hour_"                 = "หนึ่งชั่วโมง";
"_1_hour_"                  = "1 ชั่วโมง";
"_4_hours_"                 = "4 ชั่วโมง";
"_day_"                     = "Today";
"_this_week_"               = "สัปดาห์นี้";
"_days_"                    = "วัน";
"_hours_"                   = "ชั่วโมง";
"_minutes_"                 = "นาที";


"_network_not_available_"   = "Network unavailable.";
"_file_already_exists_"     = "Unable to complete the operation, a file with the same name exists.";
"_files_lock_error_"        = "There was an error changing the lock of this file.";
"_more_"                        = "เพิ่มเติม";
"_notifications_"               = "การแจ้งเตือน";
"_quota_space_unlimited_"       = "ไม่จำกัด";
"_quota_space_unknown_"         = "ไม่ทราบ";
"_quota_using_"                 = "คุณกำลังใช้ %@ จาก %@";
"_acknowledgements_"            = "การแสดงความขอบคุณ";
"_settings_"                    = "การตั้งค่า";
"_enter_password_"              = "ใส่รหัสผ่าน …";
"_lock_"                        = "ล็อก";
"_lock_active_"                 = "ล็อก: เปิด";
"_lock_not_active_"             = "ล็อก: ปิด";
"_lock_protection_no_screen_"        = "ไม่ต้องถามตอนเริ่มต้น";
"_enable_touch_face_id_"        = "เปิดใช้ Touch/Face ID";
"_wifi_only_"                   = "ใช้การเชื่อมต่อ Wi-Fi เท่านั้น";
"_settings_autoupload_"         = "อัปโหลดรูปภาพอัตโนมัติ";
"_clear_cache_"                 = "ล้างแคช";
"_clear_cache_footer_"          = "ล้างไฟล์ที่ดาวน์โหลดแล้วและออฟไลน์ออกจากแอป";
"_exit_"                        = "รีเซ็ตแอปพลิเคชัน";
"_exit_footer_"                 = "Remove all accounts and local data from the app.";
"_want_exit_"                   = "โปรดทราบ! จะตั้งค่าใหม่เป็นสถานะเริ่มต้น ดำเนินการต่อหรือไม่?";
"_want_delete_cache_"           = "Do you want to delete the cache (this also removes the transfers in progress)?";
"_add_account_"                 = "เพิ่มบัญชี";
"_want_delete_"                 = "You will delete the following: ";
"_want_leave_share_"            = "You will leave the following shares: ";
"_no_delete_"                   = "ไม่ ไม่ต้องลบ";
"_yes_delete_"                  = "ใช่ ลบ";
"_information_"                 = "ข้อมูล";
"_select_offline_warning_"      = "Making multiple files and folders available offline may take a while and use a lot of memory while doing so.";
"_advanced_"                    = "ขั้นสูง";
"_permissions_"                 = "Permissions";
"_custom_permissions_"          = "Custom permissions";
"_disable_files_app_"           = "ปิดใช้การผนวกรวมกับแอป \"ไฟล์\"";
"_disable_files_app_footer_"    = "Do not permit the access of files via the iOS Files application.";
"_time_remaining_"              = "%@ ที่เหลืออยู่";
"_autoupload_"                      = "อัปโหลดรูปภาพ/วิดีโอโดยอัตโนมัติ";
"_autoupload_select_folder_"        = "เลือกโฟลเดอร์ \"อัปโหลดอัตโนมัติ\"";
"_autoupload_photos_"               = "อัปโหลดรูปภาพอัตโนมัติ";
"_autoupload_videos_"               = "อัปโหลดวิดีโออัตโนมัติ";
"_autoupload_favorites_"            = "Auto upload favorites only";
"_autoupload_description_"          = "Choose whether new photos or videos will be automatically uploaded to your account.";
"_autoupload_fullphotos_"           = "Upload the whole camera roll";
"_start_autoupload_"                = "Turn on auto upload";
"_stop_autoupload_"                 = "Turn off auto upload";
"_autoupload_fullphotos_footer_"    = "Adjust the options above before uploading.";
"_autoupload_create_subfolder_"     = "Use subfolders";
"_autoupload_create_subfolder_footer_"  = "Store photos in subfolders based on year, month or day.";
"_autoupload_subfolder_granularity_"    = "Subfolder Granularity";
"_filenamemask_"                        = "Change filename mask";
"_filenamemask_footer_"                 = "By default, when a file is uploaded, it automatically gets the following format: yy-mm-dd hh-mm-ss plus a 4-digit counter. If you do not like this format, you can change it here except for the final 4-digit counter, which cannot be omitted.";
"_autoupload_current_folder_"           = "Currently selected folder";
"_show_hidden_files_"           = "แสดงไฟล์ที่ซ่อนอยู่";
"_format_compatibility_"        = "Most Compatible";
"_format_compatibility_footer_" = "\"Most compatible\" will save photos as JPEG, if possible.";
"_privacy_"                     = "ความเป็นส่วนตัว";
"_privacy_footer_"              = "This app uses a service for the analysis of a crash. Your personal information is not sent with the report. If you want disable it, please change the setting \"Disable crash reporter\" to ON.";
"_crashservice_title_"          = "Disable crash reporter";
"_crashservice_alert_"          = "This option requires a restart of the app to take effect.";
"_upload_mov_livephoto_"        = "Live Photo";
"_upload_mov_livephoto_footer_" = "\"Live Photo\" will save the selected photo in \"Live Photo\" format, if possible.";
"_capabilities_"                = "Capabilities";
"_capabilities_footer_"         = "Display the packages used by the app if they are installed and available on the server.";
"_diagnostics_"                 = "Diagnostics";
"_diagnostics_footer_"          = "Changing log level requires a restart of the app to take effect";
"_view_log_"                    = "View log file";
"_clear_log_"                   = "Clear log file";
"_set_log_level_"               = "Set Log level";
"_log_file_clear_alert_"        = "Log file cleared \n successfully!";
"_connect_server_anyway_"       = "คุณต้องการเชื่อมต่อไปยังเซิร์ฟเวอร์ต่อไปหรือไม่?";
"_server_is_trusted_"           = "Do you consider this server trusted?";
"_connection_error_"            = "การเชื่อมต่อผิดพลาด";
"_login_url_"                   = "Server address https:// …";
"_login_url_error_"             = "URL error, please verify your server URL";
"_login_error_"                 = "Could not log in. Please try again later.";
"_favorites_"                   = "รายการโปรด";
"_favorite_short_"              = "Favorite";
"_tutorial_favorite_view_"      = "Files and folders you mark as favorites will show up here";
"_tutorial_offline_view_"       = "Files copied here will be available offline.\n\nThey will be synchronized with your cloud.";
"_tutorial_groupfolders_view_"  = "No Group folders yet";
"_more_"                        = "เพิ่มเติม";
"_favorite_no_files_"           = "ยังไม่มีรายการโปรด";
"_no_date_information_"                     = "No date information";
"_no_camera_information_"                   = "No camera information";
"_no_lens_information_"                     = "No lens information";
"_today_"                                   = "วันนี้";
"_yesterday_"                               = "เมื่อวาน";
"_access_photo_not_enabled_"                = "Access to Photos is not enabled";
"_access_photo_not_enabled_msg_"            = "Please go to Settings → Apps → Nextcloud → Photos and enable Photo Library Access";
"_access_background_app_refresh_denied_"    = "\"Background App Refresh\" is denied. Please enable it in \"Settings\" otherwise, new photos or videos will not be detected when the application is in the background";
"_new_photos_starting_"                     = "Only photos or videos starting %@ will be uploaded.";
"_tutorial_photo_view_"                     = "No photos or videos uploaded yet";
"_error_createsubfolders_upload_"           = "Error creating subfolders";
"_remove_photo_CameraRoll_"                 = "Remove from camera roll";
"_remove_photo_CameraRoll_desc_"            = "\"Remove from camera roll\" after uploads, a confirmation message will be displayed to delete the uploaded photos or videos from the camera roll. The deleted photos or videos will still be available in the iOS Photos Trash for 30 days.";
"_never_"                       = "ไม่ต้องเลย";
"_less_a_minute_"               = "ไม่ถึงนาทีที่ผ่านมา";
"_a_minute_ago_"                = "a minute ago";
"_minutes_ago_"                 = "%d นาทีที่ผ่านมา";
"_an_hour_ago_"                 = "an hour ago";
"_hours_ago_"                   = "%d ชั่วโมงที่ผ่านมา";
"_a_day_ago_"                   = "a day ago";
"_days_ago_"                    = "%d วันที่ผ่านมา";
"_forbidden_characters_"        = "Forbidden characters: %@";
"_cannot_send_mail_error_"      = "No account is set up, or wrong email address entered.";
"_open_url_error_"              = "Cannot open the URL for this action.";
"_media_"                       = "สื่อ";
"_order_by_"                    = "เรียงตาม";
"_name_"                        = "Name";
"_date_"                        = "วันที่";
"_size_"                        = "ขนาด";
"_delete_selected_files_"       = "ลบไฟล์";
"_remove_favorites_"            = "Unfavorite";
"_add_favorites_"               = "Favorite";
"_share_"                       = "แชร์";
"_remove_local_file_"           = "Remove locally";
"_folders_"                     = "โฟลเดอร์";
"_folder_"                      = "โฟลเดอร์";
"_files_"                       = "ไฟล์";
"_file_"                        = "ไฟล์";
"_no_file_pull_down_"           = "Upload a file or pull down to refresh";
"_no_file_no_permission_to_create_" = "You don't have permission to create or upload files in this folder.";
"_limited_dimension_"           = "ถึงขีดจำกัดขนาดสูงสุด";
"_save_selected_files_"         = "Save to photo gallery";
"_file_not_saved_cameraroll_"   = "Error: File not saved in photo album";
"_file_saved_cameraroll_"       = "File saved in photo album";
"_favorite_on_top_"             = "Sort favorite first";
"_directory_on_top_"            = "Sort folders before files";
"_show_description_"            = "Show folder description";
"_show_recommended_files_"      = "Show recommendations";
"_search_no_record_found_"      = "ไม่มีผลลัพธ์";
"_search_in_progress_"          = "Search in progress …";
"_search_instruction_"          = "Search for file (minimum 2 characters)";
"_files_no_files_"              = "ไม่มีไฟล์ในนี้";
"_files_no_folders_"            = "No folders in here";
"_request_in_progress_"         = "Request to server in progress …";
"_personal_files_only_"         = "Personal files only";

"audio"                         = "เสียง";
"directory"                     = "โฟลเดอร์";
"document"                      = "เอกสาร";
"image"                         = "รูปภาพ";
"template"                      = "เทมเพลต";
"video"                         = "วิดีโอ";

"_paste_file_"                  = "วาง";
"_cancel_all_task_"             = "Cancel all transfers";
"_status_wait_download_"        = "Waiting for download";
"_status_downloading_"          = "Downloading";
"_status_wait_upload_"          = "Waiting to upload";
"_status_wait_create_folder_"   = "Waiting to create the folder";
"_status_wait_delete_"          = "Waiting to delete";
"_status_wait_rename_"          = "Waiting to rename";
"_status_wait_favorite_"        = "Waiting to change favorite";
"_status_wait_copy_"            = "Waiting to copy";
"_status_wait_move_"            = "Waiting to move";
"_status_uploading_"            = "กำลังอัปโหลด";
"_status_upload_error_"         = "Error, waiting to upload";
"_select_media_folder_"         = "Set Media folder";
"_media_viewimage_show_"        = "Show only images";
"_media_viewvideo_show_"        = "Show only video";
"_media_show_all_"              = "Show both";
"_good_morning_"                = "Good morning";
"_good_day_"                    = "Good day";
"_good_afternoon_"              = "Good afternoon";
"_good_evening_"                = "Good evening";
"_good_night_"                  = "Good night";
"_servers_"                     = "Servers";
"_select_server_"               = "Please select a server...";

// MARK: Share

"_share_link_"                  = "แชร์ลิงก์";
"_share_link_name_"             = "Link name";
"_password_"                    = "รหัสผ่าน";
"_share_password_"              = "ลิงก์ที่ป้องกันด้วยรหัสผ่าน";
"_date_"                        = "วันที่";
"_user_sharee_footer_"          = "Tap to change permissions";
"_enforce_password_protection_" = "บังคับใช้การป้องกันรหัสผ่าน";
"_shared_with_you_by_"          = "Shared with you by";
"_shareLinksearch_placeholder_" = "Name, email, or Federated Cloud ID …";
"_new_comment_"                 = "ความคิดเห็นใหม่ ...";
"_edit_comment_"                = "แก้ไขความคิดเห็น";
"_delete_comment_"              = "ลบความคิดเห็น";
"_share_read_only_"             = "View only";
"_share_editing_"               = "Can edit";
"_share_allow_upload_"          = "Allow upload and editing";
"_share_file_drop_"             = "File request";
"_share_secure_file_drop_"      = "Secure file drop (upload only)";
"_share_hide_download_"         = "Hide download";
"_share_allowed_downloads_"     = "Allowed downloads";
"_share_limit_download_"        = "Limit downloads";
"_remaining_"                   = "%d ที่เหลืออยู่";
"_share_password_protect_"      = "Password protection";
"_share_expiration_date_"       = "กำหนดวันที่หมดอายุ";
"_share_note_recipient_"        = "Note to recipient";
"_share_add_sharelink_"         = "เพิ่มลิงก์อื่น";
"_share_can_read_"              = "Read";
"_share_can_reshare_"           = "แชร์";
"_share_can_create_"            = "Create";
"_share_can_change_"            = "แก้ไข";
"_share_can_delete_"            = "Delete";
"_share_can_download_"          = "Allow download and sync";
"_share_unshare_"               = "Delete share";
"_share_internal_link_"         = "Internal link";
"_share_internal_link_des_"     = "Only works for users with access to this file/folder.";
"_share_reshare_disabled_"      = "You are not allowed to reshare this file/folder.";
"_share_reshare_restricted_"    = "Note: You only have limited permission to reshare this file/folder.";
"_remote_"                      = "Remote";
"_remote_group_"                = "Remote group";
"_conversation_"                = "Conversation";

"_no_transfer_"                     = "No transfers yet";
"_no_transfer_sub_"                 = "Uploads and downloads from this device will show up here";
"_no_activity_footer_"              = "No more activities to load";
"_transfers_"                       = "Transfers";
"_activity_"                        = "กิจกรรม";
"_trash_file_not_found_"            = "It seems that the file is not in the Trash. Go to the Trash to update it and try again.";
"_list_shares_"                     = "การแชร์";
"_list_shares_no_files_"            = "No shares yet";
"_tutorial_list_shares_view_"       = "ไฟล์และโฟลเดอร์ที่คุณแชร์กับผู้อื่นจะปรากฏที่นี่";
"_offline_"                         = "ออฟไลน์";
"_upload_photos_videos_"            = "Upload photos or videos";
"_upload_file_"                     = "อัปโหลดไฟล์";
"_create_nextcloudtext_document_"   = "Create text document";
"_use_folder_auto_upload_"          = "Use the \"Auto upload\" folder as destination";
"_filename_"                        = "ชื่อไฟล์";
"_enter_filename_"                  = "Enter filename …";
"_default_preview_filename_footer_" = "Example preview of filename: IMG_0001.JPG";
"_filename_header_"                 = "Enter filename";
"_preview_filename_"                = "Example preview of filename. You can use the mask %@ for date/time.";
"_add_filenametype_"                = "Specify type in filename";
"_maintain_original_filename_"      = "Maintain original filename";
"_notifications_"                   = "การแจ้งเตือน";
"_untitled_"                        = "Untitled";
"_e2e_settings_title_"              = "การเข้ารหัส";
"_e2e_settings_"                    = "End-to-end encryption";
"_e2e_settings_start_"              = "Start end-to-end encryption";
"_e2e_settings_activated_"          = "End-to-end encryption activated";
"_e2e_server_disabled_"             = "End-to-end encryption app disabled on server";
"_e2e_settings_view_passphrase_"    = "All 12 words together make a very strong password, letting only you view and make use of your encrypted files. Please write it down and keep it somewhere safe.";
"_e2e_settings_read_passphrase_"    = "Read passphrase";
"_e2e_settings_lock_not_active_"    = "Lock not active. Go to \"Settings\" and activate it.";
"_e2e_settings_the_passphrase_is_"  = "The passphrase is:";
"_e2e_passphrase_request_title_"    = "Request passphrase";
"_e2e_passphrase_request_message_"  = "Insert the 12 words";
"_e2e_settings_remove_"             = "Remove the encryption locally";
"_e2e_settings_remove_message_"     = "Confirm removal of encryption along with the passphrase.";
"_e2e_set_folder_encrypted_"        = "เข้ารหัส";
"_e2e_remove_folder_encrypted_"     = "ถอดรหัส";
"_e2e_file_encrypted_"              = "File encrypted";
"_e2e_goto_settings_for_enable_"    = "This is an encrypted directory, go to \"Settings\" and enable end-to-end encryption";
"_e2e_error_"                       = "An internal end-to-end encryption error occurred.";
"_e2e_in_upload_"                   = "Upload in progress, please wait for all files to be transferred.";
"_scans_document_"                  = "Scan document";
"_scanned_images_"                  = "Scanned images";
"_scan_document_pdf_page_"          = "Page";
"_scan_label_document_zone_"        = "Tap or drag images down for document creation";
"_filter_document_"                 = "Document";
"_filter_original_"                 = "Original";
"_quality_image_title_"             = "Preview image quality";
"_file_creation_"                   = "File creation";
"_delete_all_scanned_images_"       = "Delete all scanned images";
"_text_recognition_"                = "Text recognition";
"_all_files_"                       = "All files";
"_personal_files_"                  = "Personal Files";

"_trash_view_"                      = "ไฟล์ที่ถูกลบ";
"_empty_trash_"                     = "Empty trash";
"_trash_no_trash_"                  = "No files deleted";
"_trash_no_trash_description_"      = "You can restore deleted files from here";
"_confirm_delete_selected_"         = "Are you sure you want to delete the selected items?";
"_manage_file_offline_"             = "Manage offline files";
"_set_available_offline_"           = "Set as available offline";
"_remove_available_offline_"        = "Remove as available offline";
"_create_new_document_"             = "สร้างเอกสารใหม่";
"_create_new_spreadsheet_"          = "สร้างสเปรดชีตใหม่";
"_create_new_presentation_"         = "สร้างงานนำเสนอใหม่";
"_go_online_"                       = "Go online to see the document";
"_intro_1_title_"                   = "Keep your data secure and under your control";
"_intro_2_title_"                   = "Secure collaboration & file exchange";
"_intro_3_title_"                   = "Easy-to-use web mail, calendaring & contacts";
"_intro_4_title_"                   = "Screen sharing, online meetings & web conferences";
"_log_in_"                          = "Log in";
"_sign_up_"                         = "Sign up with provider";
"_host_your_own_server"             = "Host your own server";
"_invalid_url_"                         = "Invalid server URL";
"_ssl_certificate_untrusted_"           = "The certificate for this server is invalid.";
"_ssl_certificate_changed_"             = "The certificate for this server seems to have changed.";
"_file_already_exists_"                 = "Unable to complete the operation, a file with the same name exists.";
"_error_files_upload_"                  = "Error uploading files.";
"_internal_generic_error_"              = "internal error.";
"_err_permission_microphone_"           = "Please allow Microphone usage from Settings.";
"_err_permission_photolibrary_"         = "Please allow Photos from Settings.";
"_qrcode_not_authorized_"   = "This app is not authorized to use the Back Camera.";
"_qrcode_not_supported_"    = "QR code not supported by the current device.";
"_create_voice_memo_"       = "Create voice memo";
"_voice_memo_start_"        = "Tap to start";
"_voice_memo_stop_"         = "Tap to stop";
"Enter Passcode"            = "Enter Passcode";
"Enter a new passcode"      = "Enter a new passcode";
"Confirm new passcode"      = "Confirm new passcode";
"_too_many_failed_passcode_attempts_error_" = "Too many failed passcode attempts. Please try again.";
"Passcodes didn't match. Try again." = "Passcodes didn't match. Try again.";
"Delete"                    = "ลบ";
"Cancel"                    = "ยกเลิก";
"_certificate_details_"     = "Certificate Server details";
"_certificate_pn_details_"  = "Certificate Push Notification details";
"_certificate_view_"        = "Certificate Server";
"_certificate_pn_view_"     = "Certificate Push Notification";
"_save_as_scan_"            = "Save as scan";
"_save_changes_"            = "Save changes?";
"_modify_"                  = "Modify";
"_overwrite_original_"      = "Overwrite original";
"_save_as_copy_"            = "Save as copy";
"_discard_changes_"         = "Discard changes";
"_message_disable_overwrite_livephoto_" = "This image is a Live Photo, overwrite will not be possible.";
"_discard_changes_info_"    = "Your changes will be discarded.";
"_delete_files_desc_"       = "Delete files to free up space";
"_delete_old_files_"        = "Delete, in the cache, all files older than";
"_never_"                   = "ไม่ต้องเลย";
"_1_year_"                  = "1 year";
"_6_months_"                = "6 months";
"_3_months_"                = "3 months";
"_1_month_"                 = "1 month";
"_1_week_"                  = "1 week";
"_monthly_"                 = "Monthly";
"_yearly_"                  = "Yearly";
"_daily_"                   = "Daily";
"_used_space_"              = "Used space:";
"_login_address_detail_"    = "The link to your %@ web interface when you open it in the browser.";
"_go_to_page_"              = "Go to page";
"_page_"                    = "Page";
"_this_document_has_%@_pages_"              = "This document has %@ pages";
"_invalid_page_"                            = "Invalid Page";
"_the_entered_page_number_does_not_exist_"   = "The entered page number does not exist.";
"_error_something_wrong_"   = "Something went wrong";
"_try_download_full_resolution_"            = "Download full resolution image";
"_full_resolution_image_info_"            = "This may reveal more information about the photo.";
"_download_audio_"          = "Download the audio locally";
"_copied_path_"             = "Copied path";
"_privacy_screen_"          = "Hide content when app is inactive";
"_privacy_screen_footer_"   = "Hide the content in the app and show a splash screen when the app is inactive.";
"_in_"                      = "in";
"_enter_passphrase_"        = "Enter passphrase (12 words)";
"_show_more_results_"       = "⋯ Load more results";
"_waiting_for_"             = "Waiting for:";
"_reachable_wifi_"          = "network reachable via Wi-Fi or cable";
"_copy_passphrase_"         = "Copy passphrase";
"_ok_copy_passphrase_"      = "OK and copy passphrase";
"_select_color_"            = "Select the color";
"_change_color_"            = "Change color";
"_description_dashboardwidget_" = "Having the Dashboard always at your fingertips has never been easier.";
"_description_fileswidget_" = "View your recent files and use the toolbar to speed up your operations.";
"_description_toolbarwidget_"   = "A toolbar to speed up your operations.";
"_title_lockscreenwidget_"  = "Status";
"_description_lockscreenwidget_"    = "Keep an eye on available space and recent activity";

"_keep_running_"            = "Keep the app running for a better user experience.";
"_apps_nextcloud_detect_"   = "Detected %@ apps";
"_add_existing_account_"    = "Other %@ Apps has been detected, do you want to add an existing account?";
"_status_in_progress_"      = "Status reading in progress …";
"_status_e2ee_on_server_"   = "The end-to-end encryption is already configured in the server but not yet enabled on this device.";
"_status_e2ee_not_setup_"   = "The end-to-end encryption is not yet configured on the server.";
"_status_e2ee_configured_"  = "The end-to-end encryption is correctly configured.";
"_e2ee_set_as_offline_"     = "Not allowed for encrypted files or folders.";
"_change_upload_filename_"  = "Do you want to save the file with a different name?";
"_save_file_as_"            = "Save file as %@";
"_password_ascii_"          = "The password cannot contain special characters.";
"_calendar_contacts_"       = "Calendar and Contacts";
"_mobile_config_"           = "Download the configuration profile";
"_calendar_contacts_footer_warning_"    = "Configuration profile can only be downloaded if Safari is set as default browser.";
"_calendar_contacts_footer_"    = "After downloading the profile you can install it from Settings.";
"_modify_image_desc_"       = "Tap on a file to modify or rename.";
"_message_disable_livephoto_" = "This image is a Live Photo, changing it will lose the Live Photo effect.";
"_enable_livephoto_"        = "Enable Live Photo";
"_disable_livephoto_"       = "Disable Live Photo";
"_undo_modify_"             = "Undo modifying";
"_rename_already_exists_"   = "A file with this name already exists.";
"_group_folders_"           = "Group folders";
"_play_from_files_"         = "Play movie from a file";
"_play_from_url_"           = "Play movie from URL";
"_valid_video_url_"         = "Insert a valid URL";
"_chunk_move_"              = "The sent file could not be reassembled, please check the server log.";
"_download_image_"          = "Download image";
"_download_video_"          = "Download video";
"_reset_wrong_passcode_"    = "รีเซ็ตแอปพลิเคชัน";
"_reset_wrong_passcode_option_" = "Reset application after 10 failed attempts";
"_reset_wrong_passcode_desc_" = "Enabling this will remove all accounts and local data after %d failed passcode entry attempts.";
"_deviceOwnerAuthentication_" = "The biometric sensor has been temporarily disabled due to multiple failed attempts. Enter the device passcode to re-enable the sensor.";
"_virus_detect_"            = "Virus detected. Upload cannot be completed!";
"_select_photos_"           = "Select photos";
"_selected_photo_"          = "selected photo";
"_selected_photos_"         = "selected photos";
"_delete_selected_photos_"  = "Delete selected photos";
"_media_square_"            = "Square grid";
"_media_ratio_"             = "Aspect ratio grid";
"_autoupload_notice_"       = "To ensure the proper functioning of this feature, it is necessary to enable Background App Refresh. Otherwise, new photos or videos will not be detected when the application is in the background.\n\nAdditionally, please note that the app will not be able to detect new photos and videos if it is manually terminated. When the app is in the background, data transfer may be slower, and new photos and/or videos will generally be detected every 10 minutes, depending on the device’s battery level.\n\nTo verify that the app is functioning correctly, you can use the log file available in Advanced settings.";
"_display_"                 = "Display";
"_appearance_"              = "Appearance";
"_light_"                   = "Light";
"_dark_"                    = "Dark";
"_use_system_style_"        = "Use system style";
"_account_settings_"        = "Account settings";
"_users_"                   = "Users";
"_users_footer_"            = "Allows you to select an account every time you open the app.";
"_while_charging_"          = "While charging";
"_keep_screen_awake_"       = "Keep screen awake\nwhile transferring files";
"_error_not_found_"         = "The requested resource could not be found";
"_error_conflict_"          = "The request could not be completed due to a conflict with the current state of the resource";
"_error_precondition_"      = "The server does not meet one of the preconditions of the requester";
"_downloading_"             = "Downloading";
"_additional_options_"      = "Additional options";
"_unauthorizedFilesPasscode_" = "Files app cannot be used with an activated passcode";
"_disableFilesApp_"         = "Files app cannot be used because it is disabled";
"_widget_available_nc25_"   = "Widget only available starting with server version 25";
"_no_items_"                = "No items";
"_check_back_later_"        = "Check back later";
"_no_data_available_"       = "No data available";
"_recent_activity_"         = "Recent activity";
"_maintenance_mode_"        = "The server is currently in maintenance mode, which may take a while.";
"_account_disabled_"        = "Account disabled";
"_user_"                    = "ผู้ใช้";
"_add_subtitle_"            = "Add an external subtitle";
"_add_audio_"               = "Add an external audio";
"_upload_foreground_msg_"   = "Do not close %@ to complete the transfer …";
"_upload_background_msg_"   = "Files upload in progress …";
"_create_folder_error_"     = "An error has occurred while creating the folder:\n%@.\n\nPlease resolve the issue as soon as possible.\n\nAll uploads are suspended until the problem is resolved.\n";
"_creating_dir_progress_"   = "Creating directories in progress … keep the application active.";
"_creating_db_photo_progress_" = "Creating photo archive in progress … keep the application active.";
"_account_unauthorized_"    = "There was an issue authorizing the account %@. Please log in again.";
"_folder_offline_desc_"     = "Even without an internet connection, you can organize your folders, create files. Once you're back online, your pending actions will automatically sync.";
"_offline_not_allowed_"     = "This operation is not allowed in offline mode";
"_Upload_native_format_yes_"= "Upload in native format: yes";
"_Upload_native_format_no_" = "Upload in native format: no";
"_terms_of_service_"        = "Terms of service";
"_terms_accept_"            = "I acknowledge that I have read and agree to the above terms of service.";
"_terms_accepted_"          = "Terms accepted";
"_recommended_files_"       = "Recommended Files";
"_propagate_layout_"        = "Apply the following change to all subfolders";
"_version_mismatch_error_"  = "Version change: please open the main app to update the data.";
"_check_auto_upload_"       = "Automatic photo upload is currently disabled.\nWith Nextcloud iOS you can automatically back up your photos and keep them safe on your server.\nJust open Settings → Auto Upload, choose the options you prefer, and turn it on with the \"%@\" button.";
"_cancel_all_request_"      = "Are you sure you want to cancel all transfers?";
"_cancel_all_"              = "Cancel All";
"_dismiss_"                 = "ปิดทิ้ง";
"_opt_in_pro_"              = "Optimization in progress …";
"_update_in_progress_"      = "Update in progress …";
"_delete_in_progress_"      = "Delete in progress …";
"_download_in_progress_"    = "Download in progress …";
"_upload_in_progress_"      = "Upload in progress …";
"_transfer_in_progress_"    = "Transfer in progress …"; 
"_in_waiting_"              = "In waiting";
"_in_progress_"             = "In progress";
"_in_error_"                = "In error";
"_retry_minutes_"           = "min left to retry";
"_retry_seconds_"           = "sec left to retry";
"_retry_soon_"              = "retrying soon …";
"_large_upload_tip_"        = "Large files require the app to remain open until the transfer is complete";
"_e2ee_upload_tip_"         = "End-to-end files require the app to remain open until the transfer is complete";
"_finalizing_wait_"         = "Waiting for finalization …";
"_in_this_folder_"          = "In this folder";

// Tip
"_tip_pdf_thumbnails_"      = "Swipe left from the right edge of the screen to show the thumbnails";
"_tip_accountrequest_"      = "Touch here to change account or to add a new one";
"_tip_addcopyimage_"        = "Long press to paste a copied image";
"_tip_open_mediadetail_"    = "Swipe up to show the details";
"_tip_autoupload_button_"   = "Configure the options as you prefer (folder, Wi-Fi, new content, subfolders) and tap ‘Turn on auto uploading’.\nYou can stop it at any time, adjust the settings, and enable it again.";

// MARK: Accessibility

// Accessibility, floating panel top element
"_cart_controller_"             = "Card controller";
"_accessibility_add_upload_"    = "เพิ่มและอัปโหลด";
"_dismiss_menu_"                = "Dismiss the menu";
"_show_profile_"                = "Show profile";
// a11y: On/Off
"_on_"                          = "On";
// a11y: On/Off
"_off_"                         = "Off";
"_list_"                        = "List";
"_icons_"                       = "Icons";

// MARK: Assistant
"_assistant_task_unknown_"       = "Unknown";
"_assistant_task_scheduled_"     = "Scheduled";
"_assistant_task_in_progress_"   = "In Progress";
"_assistant_task_completed_"     = "Completed";
"_assistant_task_failed_"        = "Failed";
"_input_"                        = "Input";
"_output_"                       = "Output";
"_task_details_"                 = "Task details";
"_assistant_"                    = "Assistant";
"_new_task_"                     = "New %@ task";
"_no_tasks_"                     = "Hello there! What can I help you with today?";
"_create_task_subtitle_"         = "Use the + button to create a new task";
"_edit_task_"                    = "Edit %@ task";
"_no_types_"                     = "No provider found";
"_no_types_subtitle_"            = "AI Providers need to be installed to use the Assistant.";
"_assistant_ai_warning_"         = "Output shown here is generated by AI. Make sure to always double-check.";
"_no_chat_subtitle_"             = "Try sending a message to spark a conversation.";
"_retry_response_generation_"    = "Retry response generation";
"_conversations_"                = "Conversations";
"_new_conversation_"             = "New conversation";
"_type_message_"                 = "Type a message...";
"_assistant_chat_"               = "Assistant Chat";
"_assistant_error_send_message_"  = "Could not send message. Please try again.";
"_assistant_error_load_messages_" = "Could not load messages. Please try again.";
"_assistant_error_generate_response_" = "Could not generate response. Please try again.";
// MARK: Client certificate
"_no_client_cert_found_"         = "The server is requesting a client certificate.";
"_no_client_cert_found_desc_"    = "Do you want to install a TLS client certificate? \n Note that the .p12 certificate must be installed on your device first by clicking on it and installing it as an Identitity Certificate Profile in Settings. The certificate MUST also have a password as that is a requirement by iOS.";
"_client_cert_enter_password_"   = "Enter the password for the chosen certificate";
"_client_cert_wrong_password_"   = "Sorry, you entered an invalid password.";

// MARK: Login poll
"_poll_desc_"                    = "Please complete the log in process in your browser.";

// MARK: File name validator (used by NextcloudKit, don't remove)
"_file_name_validator_error_ends_with_space_period_" = "Name must not contain spaces at the beginning or end.";
"_file_name_validator_error_reserved_name_" = "\"%@\" is a forbidden name.";
"_file_name_validator_error_forbidden_file_extension_" = "\".%@\" is a forbidden file extension.";
"_file_name_validator_error_invalid_character_" = "Name contains an invalid character: \"%@\".";
"_file_name_validator_error_space_" = "Name must not contain spaces at the beginning or end.";
"_file_name_new_extension_" = "Changing the extension might cause this file to open in a different application.";
"_file_name_empty_" = "File name cannot be empty.";
"_please_rename_file_" = "Please rename the file or folder.";
"hidden_file_name_warning" = "Name will result in a hidden file.";

"_camera_roll_" = "ม้วนฟิล์ม";
"_destination_" = "ปลายทาง";
"_select_autoupload_albums_" = "Select albums";
"_upload_from_" = "Upload from";
"_multiple_albums_" = "Multiple albums";
"_smart_albums_" = "Smart albums";
"_albums_" = "Albums";
"_new_photos_only_" = "New photos only";
"_all_photos_" = "All photos";
//"_back_up_" = "Back up...";
"_back_up_new_photos_only_" = "Back up new photos/videos only";
"_auto_upload_all_photos_warning_title_" = "Are you sure you want to upload all photos?";
"_auto_upload_all_photos_warning_message_" = "This can take some time to process depending on the amount of photos.";
"_item_with_same_name_already_exists_" = "An item with the same name already exists.";

// MARK: Migration Multi Domains

"_preparing_migration_" = "Preparing migration …";
"_scanning_files_" = "Scanning files …";
"_moving_items_to_domain_" = "Moving items to correct domain …";
"_finishing_up_" = "Finishing up …";
